GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18f47q43.inc
;----- CONFIG7 Options --------------------------------------------------
_BBSIZE_BBSIZE_32768_7 EQU  H'F9'; Boot Block size is 32768 words
_BBSIZE_BBSIZE_16384_7 EQU  H'FA'; Boot Block size is 16384 words
_BBSIZE_BBSIZE_8192_7 EQU  H'FB'; Boot Block size is 8192 words
_BBSIZE_BBSIZE_4096_7 EQU  H'FC'; Boot Block size is 4096 words
_BBSIZE_BBSIZE_2048_7 EQU  H'FD'; Boot Block size is 2048 words
_BBSIZE_BBSIZE_1024_7 EQU  H'FE'; Boot Block size is 1024 words
_BBSIZE_BBSIZE_512_7 EQU  H'FF'; Boot Block size is 512 words

_BBEN_ON_7           EQU  H'F7'; Boot block enabled
_BBEN_OFF_7          EQU  H'FF'; Boot block disabled

_SAFEN_ON_7          EQU  H'EF'; SAF enabled
_SAFEN_OFF_7         EQU  H'FF'; SAF disabled

_DEBUG_ON_7          EQU  H'DF'; Background Debugger enabled
_DEBUG_OFF_7         EQU  H'FF'; Background Debugger disabled

;----- CONFIG8 Options --------------------------------------------------
_WRTB_ON_8           EQU  H'FE'; Boot Block Write protected
_WRTB_OFF_8          EQU  H'FF'; Boot Block not Write protected

_WRTC_ON_8           EQU  H'FD'; Configuration registers Write protected
_WRTC_OFF_8          EQU  H'FF'; Configuration registers not Write protected

_WRTD_ON_8           EQU  H'FB'; Data EEPROM Write protected
_WRTD_OFF_8          EQU  H'FF'; Data EEPROM not Write protected

_WRTSAF_ON_8         EQU  H'F7'; SAF Write Protected
_WRTSAF_OFF_8        EQU  H'FF'; SAF not Write Protected

_WRTAPP_ON_8         EQU  H'7F'; Application Block write protected
_WRTAPP_OFF_8        EQU  H'FF'; Application Block not write protected

;----- CONFIG10 Options --------------------------------------------------
_CP_ON_10            EQU  H'FE'; PFM and Data EEPROM code protection enabled
_CP_OFF_10           EQU  H'FF'; PFM and Data EEPROM code protection disabled


;----- DEVID Equates --------------------------------------------------
_DEVID1          EQU  H'3FFFFE'
_DEVID2          EQU  H'3FFFFF'

;----- IDLOC Equates --------------------------------------------------
_IDLOC0          EQU  H'200000'
_IDLOC1          EQU  H'200001'
_IDLOC2          EQU  H'200002'
_IDLOC3          EQU  H'200003'
_IDLOC4          EQU  H'200004'
_IDLOC5          EQU  H'200005'
_IDLOC6          EQU  H'200006'
_IDLOC7          EQU  H'200007'
_IDLOC8          EQU  H'200008'
_IDLOC9          EQU  H'200009'
_IDLOC10         EQU  H'20000A'
_IDLOC11         EQU  H'20000B'
_IDLOC12         EQU  H'20000C'
_IDLOC13         EQU  H'20000D'
_IDLOC14         EQU  H'20000E'
_IDLOC15         EQU  H'20000F'
_IDLOC16         EQU  H'200010'
_IDLOC17         EQU  H'200011'
_IDLOC18         EQU  H'200012'
_IDLOC19         EQU  H'200013'
_IDLOC20         EQU  H'200014'
_IDLOC21         EQU  H'200015'
_IDLOC22         EQU  H'200016'
_IDLOC23         EQU  H'200017'
_IDLOC24         EQU  H'200018'
_IDLOC25         EQU  H'200019'
_IDLOC26         EQU  H'20001A'
_IDLOC27         EQU  H'20001B'
_IDLOC28         EQU  H'20001C'
_IDLOC29         EQU  H'20001D'
_IDLOC30         EQU  H'20001E'
_IDLOC31         EQU  H'20001F'

        LIST
